#+TITLE: about emacs org-mode softly

* read words about it
  - http://orgmode.org/worg/org-quotes.html

* command
  - C-c C-e b : export to html file then open it from browser
  - C-c a : type command for agenda view

* calc or spreadsheet

#+BEGIN_SRC 
(setq org-html-table-default-attributes
      '(:border "2" :cellspacing "0" :cellpadding "6" :rules "all" :frame "border"))
;;      '(:border "2" :cellspacing "0" :cellpadding "6" :rules "none" :frame "none"))
#+END_SRC

#+BEGIN_SRC 
#+ATTR_HTML: :border 2 :rules all :frame border
#+END_SRC

| x | y | z | sum using vsum |
|---+---+---+----------------|
| 1 | 1 | 1 |              3 |
| 2 | 2 | 2 |              6 |
| 3 | 3 | 3 |              9 |
|---+---+---+----------------|
| 0 | 0 | 0 |              6 |
#+TBLFM: $4=vsum($1..$3)::@5$4=vsum(@2$2..@4$2)

** detail

- C-c ?
- C-c }
- = : field
- := : column totally 
- $2 : column
- @3 : row
- @3$2
- vmean, vcount, vsum, vmax
- C-c ' : new buffer
- C-c { : debug

** link

- C-c C-l : create link
- C-c C-o : open link

[[shell:ls%20-ltr%20|%20grep%20foo][this is the date]]  execute shell script in here
[[file:wiki.org][wiki]] simply
[[elisp:(princ%20(%2B%203%203))][sum]] can run lisp code on it, elisp

* is the future of the text format?!

* tag

** this is the more							:tag:
** and more							   :love:tag:
** some of							       :love:
